set up project, db and model
